var sArea = {
	init : function(id) {
		var sf = document.getElementById(id);
		var sf2 = document.getElementById(id + 'Child');

		if (sf.tagName.toLowerCase() == 'select') {
			if (sf.options.length < 2) {
				sf.options[sf.options.length] = new Option("请选择..", "");
				for (name in sArea.areaList) {
					// 修改为只访问自己的变量
					if (sArea.areaList.hasOwnProperty(name)) {
						sf.options[sf.options.length] = new Option(name, name);
					}
				}
				sf.options[sf.options.length] = new Option("其他", "其他");
			}
		}
		if (sf2.tagName.toLowerCase() == 'select') {
			sf2.options[sf2.options.length] = new Option("请选择..", "");

		}
		if (window.addEventListener) { // Mozilla, Netscape, Firefox
			sf.addEventListener("change", function() {
				sArea.listChild(sf.value, id)
			}, false);
		} else { // IE
			sf.attachEvent('onchange', function() {
				sArea.listChild(sf.value, id)
			});
		}

		sf.setAttribute("onchange", "sArea.listChild(this.value,this.id)");
		return true;
	},
	listChild : function(pName, pId) {
		var sf2 = document.getElementById(pId + 'Child');
		sf2.options.length = 0;
		sf2.options[sf2.options.length] = new Option("请选择..", "");

		for (idx in sArea.areaList[pName]) {
			if (sArea.areaList[pName].hasOwnProperty(idx)) {
				var name = sArea.areaList[pName][idx];
				sf2.options[sf2.options.length] = new Option(name, name);
			}
		}

	},
	areaList : {
		"北京" : [ "东城 ", "西城 ", "崇文 ", "宣武 ", "朝阳 ", "丰台 ", "石景山 ", "海淀 ",
				"门头沟 ", "房山 ", "通州 ", "顺义 ", "延庆", "昌平", "怀柔", "密云", "平谷", "大兴" ],
		"天津" : [ "和平 ", "河东 ", "河西 ", "南开 ", "河北 ", "红桥 ", "塘沽 ", "大港 ", "汉沽 ",
				"东丽 ", "西青 ", "津南 ", "北辰 ", "蓟县", "宝坻", "武清", "宁河", "静海" ],
		"上海" : [ "卢湾 ", "徐汇 ", "长宁 ", "静安 ", "普陀 ", "闸北 ", "虹口 ", "杨浦 ",
				"闵行 ", "宝山 ", "嘉定 ", "浦东新 ", "金山 ", "松江 ", "崇明", "青浦", "南汇",
				"奉贤", "黄浦 " ],
		"重庆" : [ "重庆", "城口", "大足", "垫江", "丰都", "奉节", "合川", "江津", "开县", "梁平",
				"南川", "彭水", "荣昌", "石柱", "铜梁", "巫山", "巫溪", "武隆", "秀山", "永川",
				"酉阳", "云阳", "忠县", "潼南", "璧山", "綦江" ],
		"香港" : [ "香港", "九龙", "新界", "大屿" ],
		"澳门" : [ "澳门" ],
		"西藏" : [ "阿里", "昌都", "拉萨", "林芝", "那曲", "日喀则", "山南" ],
		"新疆" : [ "阿克苏", "阿拉尔", "巴音郭楞", "博尔塔拉", "昌吉", "哈密", "和田", "喀什", "克拉玛依",
				"克孜勒苏柯尔克孜", "石河子", "图木舒克", "吐鲁番", "乌鲁木齐", "奎屯", "五家渠", "伊犁哈萨克" ],
		"内蒙古" : [ "阿拉善盟", "巴彦淖尔盟", "包头", "赤峰", "呼和浩特", "呼伦贝尔", "通辽", "乌海",
				"乌兰察布盟", "锡林郭勒盟", "兴安盟", "鄂尔多斯" ],
		"广西" : [ "百色", "北海", "崇左", "防城港", "桂林", "贵港", "河池", "贺州", "来宾", "柳州",
				"南宁", "钦州", "梧州", "玉林" ],
		"宁夏" : [ "固原", "石嘴山", "吴忠", "银川" ],
		"山西" : [ "长治", "大同", "晋城", "晋中", "临汾", "吕梁", "朔州", "太原", "忻州", "阳泉",
				"运城" ],
		"河南" : [ "安阳", "鹤壁", "济源", "焦作", "洛阳", "南阳", "开封", "平顶山", "三门峡", "商丘",
				"信阳", "新乡", "许昌", "郑州", "周口", "驻马店", "漯河", "濮阳" ],
		"河北" : [ "保定", "沧州", "邯郸", "承德", "衡水", "秦皇岛", "廊坊", "石家庄", "唐山", "邢台",
				"张家口" ],
		"江西" : [ "抚州", "赣州", "吉安", "景德镇", "九江", "南昌", "上饶", "萍乡", "新余", "宜春",
				"鹰潭" ],
		"湖南" : [ "常德", "长沙", "郴州", "衡阳", "怀化", "娄底", "邵阳", "湘潭", "湘西", "益阳",
				"永州", "岳阳", "张家界", "株洲" ],
		"江苏" : [ "常州", "连云港", "淮安", "南京", "南通", "苏州", "宿迁", "泰州", "无锡", "徐州",
				"盐城", "扬州", "镇江" ],
		"浙江" : [ "杭州", "湖州", "嘉兴", "金华", "丽水", "宁波", "绍兴", "台州", "温州", "舟山",
				"衢州" ],
		"安徽" : [ "安庆", "蚌埠", "巢湖", "池州", "滁州", "阜阳", "合肥", "淮北", "淮南", "黄山",
				"六安", "马鞍山", "宿州", "铜陵", "芜湖", "宣城", "亳州" ],
		"湖北" : [ "鄂州", "恩施", "黄冈", "黄石", "荆门", "荆州", "神农架林区", "潜江", "十堰", "随州",
				"天门", "武汉", "咸宁", "仙桃", "襄樊", "孝感", "宜昌" ],
		"黑龙江" : [ "大庆", "大兴安岭", "哈尔滨", "鹤岗", "黑河", "鸡西", "佳木斯", "牡丹江", "七台河",
				"齐齐哈尔", "双鸭山", "绥化", "伊春" ],
		"吉林" : [ "白城", "白山", "长春", "吉林", "辽源", "四平", "松原", "通化", "延边" ],
		"辽宁" : [ "鞍山", "本溪", "朝阳", "大连", "丹东", "抚顺", "阜新", "葫芦岛", "锦州", "辽阳",
				"盘锦", "沈阳", "铁岭", "营口" ],
		"陕西" : [ "安康", "宝鸡", "汉中", "商洛", "铜川", "西安", "渭南", "咸阳", "延安", "榆林" ],
		"甘肃" : [ "白银", "定西", "甘南", "嘉峪关", "金昌", "酒泉", "兰州", "临夏", "陇南", "平凉",
				"庆阳", "天水", "武威", "张掖" ],
		"青海" : [ "果洛", "海北", "海东", "海南", "海西", "黄南", "西宁", "玉树" ],
		"云南" : [ "保山", "楚雄", "大理", "德宏", "迪庆", "红河", "昆明", "丽江", "临沧", "怒江",
				"曲靖", "思茅", "文山", "西双版纳", "玉溪", "昭通" ],
		"贵州" : [ "安顺", "毕节", "贵阳", "六盘水", "黔东南", "黔南", "铜仁", "遵义", "黔西南" ],
		"四川" : [ "阿坝", "巴中", "德阳", "成都", "达州", "甘孜", "广安", "广元", "乐山", "凉山",
				"眉山", "绵阳", "南充", "内江", "攀枝花", "遂宁", "雅安", "宜宾", "资阳", "自贡",
				"泸州" ],
		"福建" : [ "福州", "龙岩", "南平", "宁德", "莆田", "泉州", "三明", "漳州", "厦门" ],
		"山东" : [ "滨州", "德州", "东营", "菏泽", "济南", "济宁", "莱芜", "聊城", "临沂", "青岛",
				"日照", "泰安", "威海", "潍坊", "烟台", "枣庄", "淄博" ],
		"广东" : [ "潮州", "东莞", "佛山", "广州", "河源", "江门", "揭阳", "惠州", "茂名", "梅州",
				"清远", "汕头", "汕尾", "韶关", "深圳", "阳江", "云浮", "湛江", "肇庆", "中山",
				"珠海" ],
		"海南" : [ "白沙", "保亭", "昌江", "澄迈", "定安", "海口", "东方", "乐东", "临高", "陵水",
				"琼海", "琼中", "三亚", "屯昌", "万宁", "文昌", "五指山", "儋州" ],
		"台湾" : [ "台北", "高雄", "台南", "台中", "基隆", "新竹" ],
		"国外" : [ "北美", "南美", "澳洲", "亚洲", "欧洲", "非洲" ]
	}

}